{
	"origin": [
		"#tngintro# #tngperson# #tngthings# #reason#",
		"#entintro# #entperson# #entthings# #reason#",
		"#tosintro# #tosperson# #tosthings# #reason#",
		"#voyintro# #voyperson# #voythings# #reason#",
		"#ds9intro# #ds9person# #ds9things# #reason#",
		"#discintro# #discperson# #discthings# #reason#"
	],
	"tngintro": [
		"In this episode",
		"This time",
		"Tonight on Star Trek: The Next Generation\n"
	],
	"entintro": [
		"In this episode",
		"This time",
		"Tonight on Enterprise\n"
	],
	"tosintro": [
		"In this episode",
		"This time",
		"Tonight on Star Trek\n"
	],
	"voyintro": [
		"In this episode",
		"This time",
		"Tonight on Star Trek: Voyager\n"
	],
	"ds9intro": [
		"In this episode",
		"This time",
		"Tonight on Deep Space 9\n"
	],
	"discintro": [
		"In this episode",
		"This time",
		"Tonight on Star Trek: Discovery",
		"Next week, on CBS All-Access"
	],
	"tngperson": [
		"Captain Picard",
		"Lt. Cmdr Worf",
		"Chief O'Brien",
		"Geordi",
		"Dr. Crusher",
		"Dr. Pulaski",
		"Counselor Troi",
		"Data",
		"Guinan",
		"Ensign Ro"
	],
	"entperson":[
		"Captain Archer",
		"Lt. Reed",
		"Travis",
		"Hoshi",
		"Subcommander T'Pol"
	],
	"tosperson": [
		"Captain Kirk",
		"Spock",
		"Dr. McCoy",
		"Mr. Scott",
		"Uhura",
		"Chekov",
		"Mr. Sulu"
	
	],
	"voyperson": [
		"Captain Janeway",
		"The EMH",
		"Cmdr. Tuvok",
		"Chakotay",
		"Tom Paris",
		"B'Elanna",
		"Harry",
		"Kes",
		"Seven of Nine"
	],
	"ds9person":[
		"Commander Sisko",
		"Chief O'Brien",
		"Kira",
		"Odo",
		"Dr. Bashir",
		"Dax",
		"Nog"
	],
	"discperson":[
		"Captain Lorca",
		"Commander Saru",
		"Lieutenant Tyler",
		"Michael",
		"Lieutenant Stamets",
		"Ensign Tilly",
		"Doctor Culber",
		"Voq",
		"Kol",
		"Admiral Cornwell",
		"L'Rell"
	],


	"discthings": [
		"can't stop watching reruns of 2 Broke Girls on CBS",
		"increases the frequency of Black Alert drills",
		"crosses into the mirror universe to steal a pizza ordered by their counterpart",
		"finds out how to get really high on mycelium spores",
		"accidentally gets really high on mycelium spores",
		"gets caught running a tardigrade fighting ring",
		"accidentally starts a war with the Klingons",
		"is convicted of mutiny",
		"implants their personality into another character's subconscious",
		"can't stop jumping or the spore drive will explode",
		"gets stuck in a time loop",
		"reconfigures the spore drive to mine bitcoin"
	],
	
	"entthings": [
		"is caught in a time bubble",
		"makes first contact with a race of sentient insects",
		"goes to shore leave on Risa",
		"battles the Klingon Battlecruiser Qo'Blos",
		"finds a giant space creature",
		"meets another fake god",
		"makes first contact with a new, obviously stereotypical, alien race",
		"returns from shore leave",
		"has a transporter accident",
		"finds a post-apocalyptic civilization",
		"finds something in the Vulcan database",
		"solves the puzzle onboard a derelict space station",
		"meets space nazis",
		"meets a friendly robot who just wants to love",
		"returns to Earth's past",
		"travels through time",
		"hopes that the next leap is the leap home",
		"finally figures out how to make a cloak work",
		"can't leave well enough alone",
		"can't escape a dream",
		"can't stop dancing",
		"is eaten by a giant space lobster",
		"finds out the true meaning of Christmas",
		"accidentally starts a war between two alien races",
		"is infected with time-travelling brain parasites",
		"can't go below warp 5 or the core will explode",
		"searches for the Xindi weapon",
		"hides inside a Xindi Cracker Barrel restaurant",
		"gets lunch with Degra and always goes to the bathroom before the check gets to the table",
		"goes into a coma while working on the engines",
		"is trapped in an addictive game called ioquake3",
		"repurposes the ship's computers to mine bitcoin"
	],
	
	"tngthings": [
		"accidentally discovers new life on the holodeck",
		"battles a Borg cube",
		"meets a Q",
		"has some meetings that seem like they're going nowhere",
		"is caught in a time bubble",
		"makes first contact with a race of sentient insects",
		"infiltrates the Romulan empire",
		"goes to shore leave on Risa",
		"finds a giant space creature",
		"makes first contact with a new, obviously stereotypical, alien race",
		"battles the Klingon Battlecruiser Qo'Blos",
		"meets another fake god",
		"returns from shore leave",
		"has a transporter accident",
		"finds a post-apocalyptic civilization",
		"solves the puzzle onboard a derelict space station",
		"meets space nazis",
		"meets a friendly robot who just wants to love",
		"returns to Earth's past",
		"travels through time",
		"finally figures out how to make a cloak work",
		"can't leave well enough alone",
		"sure as shit isn't going into another meeting",
		"can't escape a dream",
		"can't stop dancing",
		"finds out the true meaning of Christmas",
		"has a transporter accident and turns back into a child",
		"is trapped on a shuttle with a fully mature Wesley",
		"has a transporter accident and shoots phasers from their mouth whenever they talk",
		"spends the entire episode on a FaceTime call with Admiral Vance",
		"accidentally starts a war between two alien races",
		"can't control their holodeck addiction",
		"orders tea from the replicator and thinks really hard",
		"celebrates Captain Picard day, alone,",
		"can't go below warp 5 or the core will explode",
		"paints some art and drinks wine",
		"has a turbolift tantrum",
		"learns a valuable lesson from Q",
		"learns a valuable lesson from Q about sorting their groceries",
		"visits Deep Space 9",
		"is eaten by a tar monster",
		"goes on an incredible journey inside the life of a person from an ancient civilization",
		"plays poker with the gang",
		"sings Frère Jacques in the jefferies tube with some young people",
		"gets peer pressured by some teens into arbitrating the next Klingon succession",
		"gets way into Klingon pain-sticks",
		"has to solve a Sherlock Holmes mystery in order to unlock the holodeck",
		"is into some noir shit on the Holodeck",
		"is trapped in an addictive game called ioquake3",
		"loses a valued crewmember we've never heard of before on an away mission",
		"has to cope with the loss of a valued crew member we have never heard of before and will never be mentioned again",
		"meets survivors of a war on a decimated planet",
		"can't decide if they should holiday on Corsica or Risa",
		"has a panic attack when a Romulan warbird decloaks off the port bow and they forgot to clean the shield conduits two hours ago",
		"tries to convince the colonists on Rigel VII to leave when their sun is about to explode",
		"tries to convince the colonists on Walnut VII to leave when their moon is about to crash into the planet",
		"attends a klingon yoga class",
		"gets attacked by a tube with a mouth in the transporter beam",
		"plays Dom-Jot with Ensign Reyes again",
		"repurposes the ship's computers to mine bitcoin"
	],
	
	"tosthings": [
		"is stuck in The Nexus for 75 years",
		"discovers a new planet",
		"is caught in a time bubble",
		"infiltrates the Romulan empire",
		"makes first contact with a race of sentient insects",
		"battles the Klingon Battlecruiser Qo'Blos",
		"makes first contact with a new, obviously stereotypical, alien race",
		"finds a giant space creature",
		"meets another fake god",
		"has a transporter accident",
		"finds a post-apocalyptic civilization",
		"accidentally forgets crewman Reyes on Seti Alpha VI",
		"solves the puzzle onboard a derelict space station",
		"meets space nazis",
		"meets a friendly robot who just wants to love",
		"returns to Earth's past",
		"travels through time",
		"finally figures out how to make a cloak work",
		"can't leave well enough alone",
		"finds a colony of children",
		"confuses an entirely logical race of brains in jars",
		"talks with Spock's brain",
		"accidentally starts a war between two alien races",
		"has some trouble with tribbles",
		"lets the ship get taken over by some aliens with belts that make everyone play freeze tag",
		"eats some food cubes",
		"watches as Yeoman Reyes is turned into novelty-sized dice",
		"Crosses the galactic barrier",
		"enables the self-destruct to go off whenever the ship passes a Space Wendys",
		"is trapped in an addictive game called ioquake3",
		"repurposes the ship's computers to mine bitcoin"
	],
	
	"voythings": [
		"accidentally discovers new life on the holodeck",
		"battles a Borg cube",
		"meets a Q",
		"has a transporter accident and is merged with Neelix",
		"is caught in a time bubble",
		"discovers a new planet",
		"returns from shore leave",
		"finds a giant space creature",
		"makes first contact with a new, obviously stereotypical, alien race",
		"makes first contact with a race of sentient insects",
		"meets another fake god",
		"has a transporter accident",
		"finds a post-apocalyptic civilization",
		"meets space nazis",
		"meets a friendly robot who just wants to love",
		"returns to Earth's past",
		"travels through time",
		"solves the puzzle onboard a derelict space station",
		"finally figures out how to make a cloak work",
		"can't leave well enough alone",
		"sure as shit isn't going into another meeting",
		"wishes the crew would stop asking for more replicator rations",
		"can't escape a dream",
		"can't stop dancing",
		"finds out the true meaning of Christmas",
		"accidentally starts a war between two alien races",
		"can't control their holodeck addiction",
		"meets Amelia Earhart",
		"meets a hyperintelligent George Costanza forehead alien",
		"isn't sure if they can love anymore",
		"ignores the prime directive",
		"can't go below warp 5 or the core will explode",
		"is trapped in an addictive game called ioquake3",
		"repurposes the Delta Flyer's computers to mine bitcoin"
	],
	
	"ds9things": [
		"accidentally discovers new life on the holodeck",
		"battles a Borg cube",
		"meets a Q",
		"is caught in a time bubble",
		"travels through time",
		"finally figures out how to make a cloak work",
		"has a transporter accident",
		"infiltrates the Romulan empire",
		"accidentally tripped a Cardassian booby trap that pipes smooth jazz through the station",
		"can't leave well enough alone",
		"can't escape a dream",
		"can't stop dancing",
		"can't control their holodeck addiction",
		"finds out the true meaning of Christmas",
		"figures out that everyone onboard is actually a changeling",
		"plays baseball again for some reason",
		"has some trouble with tribbles",
		"battles the Jem'Hadar",
		"is trapped in an addictive game called ioquake3",
		"finds themselves speaking with the prophets",
		"spent fifteen hours explaining baseball with the prophets and getting nowhere",
		"has to deal with Gul Jasad",
		"has some interstellar shit going down in the wormhole",
		"goes to meetings about their Roladan Wild Draw addiction",
		"hires Nathan Fielder to spice up business on the Promenade",
		"adds poo flavored synthahol to Quark’s bar in an attempt to draw in more business",
		"visits the Celestial Temple",
		"reminds everyone about the provisional government",
		"has a heck of a bad day",
		"triggers a Cardassian booby trap that causes the station’s replicator’s to only produce Taco Bell food",
		"solves a B-plot problem with an explosion at the end of the episode because the solution to the A-plot was too boring to air, so it gets explained away with a voiceover",
		"goes on a holosuite adventure",
		"is Tosk for a day",
		"is hijacked by a space pirate named Vantika for nefarious purposes",
		"and the other senior officers welcome a group of alien German board game enthusiasts aboard for first contact",
		"was here for the groveling",
		"is the new Grand Negus",
		"is given a bauble from Kai Opaka’s Etsy shop",
		"becomes the Sirah (local televangelist) for a town on Bajor that has never seen an episode of Scooby-Doo",
		"tries to get rid of 5000 wrappages of yamok sauce",
		"now has to deal with 100 gross of self-sealing stem bolts. Whatever those are,",
		"destroys an old man’s cottage so they can kick the old man out of his home after abducting his best friends",
		"wakes up mommy and daddy to tell them that Rumpelstiltskin is in their room",
		"is followed off the holodeck by the most famous baseball player of all time, Kent Tekulve",
		"fights with what appears to be their duplicate, if they were attracted to the doctor",
		"is dismayed when once again, a major subspace distortion causes a loss of contact with the Rio Grande",
		"can't help the prophets figure out the secrets of deep dish pizza",
		"opens a space-Etsy shop to exploit the people of Bajor and their love for cheap jewelery",
		"learns that the prophets want to make the wormhole a 24/7 rave",
		"has to regenerate in their bucket every 16 hours",
		"needs to be careful who they share their Jumja stick with",
		"gets their ears touched by Vedek Winn, this is never explained ",
		"finds a puddle of Ensign Aquino, nobody writes a letter to their family or seems to mind at all, ",
		"runs through the promenade, naked, screaming something about the prophets and stuffed-crust starships",
		"tells somebody else about their dreams, the other person keeps walking and pretends they didn’t hear it",
		"hallucinates a specter of their dead loved one on the anniversary of their death",
		"is stuck on Sebulon Gebulon IV due to a duonetic field",
		"is the main for the A plot",
		"gets back in the punishment box on Vegon XII",
		"discovers that holograms can be real people, too",
		"plays a few rounds of Tongo",
		"destroys a starter universe",
		"is betrayed by an old friend who we’ve never heard of before this episode, and we will never hear about again",
		"is abducted and taken to stand trial on Cardassia Prime for grand theft yamok sauce",
		"has too many encounters with the orbs of the prophets for one episode",
		"betrays the crew for the last time",
		"fights Cardassian voles for 45 incredibly boring minutes",
		"fights Cardassian voles for 45 incredibly exciting minutes",
		"finds out that their entire life is based on a lie",
		"travels back in time to an Earth where a member of Neo Pearl Jam is taking hostages",
		"travels back in time to an Earth where a member of a cult run by Alessandro Cortini is taking hostages",
		"travels back in time to Kamurocho and gets their ass kicked by Kazuma Kiryu",
		"travels back in time to Sotenbori and gets their ass kicked by Goro Majima",
		"thinks they’ve won the truth from Garak",
		"finds out that Old Jake has been running his old-man-dying-with-his-dad-trapped-in-subspace scam on lady writers again",
		"is trapped in a holosuite for the 119 innings of 0-to-0 overtime that destroyed baseball",
		"is trapped in a nightmare version of DS9 created by a weird face alien that wants to destroy their self-confidence for some reason",
		"ends up stranded in a space colony full of people that post to tik-tok",
		"finds Kahless’ bat’leth and then chucks it out the airlock when they realize that Kahless had a 12-pack from Space Costco",
		"solves Admiral Leyton’s matchstick puzzle",
		"gives up on therapy or any other solutions and just performs a mind wipe on their best friend to solve depression because somehow that’s a solution according to Ron Moore",
		"gets sent to mind jail for 20 years and murders their cell mate over some MTG cards",
		"gets sent to mind jail for 40 years and murders their cell mate over some Pokèmon cards",
		"is sentenced to 20 years in a labor camp for mind crimes on some planet we’ve never heard of before or since",
		"starts yelling about teeth on the promenade",
		"is addicted to Space Tik Tok",
		"comes back from the gamma quadrant pregnant with the O’Brien’s baby",
		"sells their vacuum desiccated remains on the Ferengi Futures Exchange",
		"joins the Founders’ Great Web Ring",
		"has their mind vacuumed out by some creativity beast while writing some hits for Space SoundCloud",
		"is sad that their lover is actually a Maquis smuggler",
		"collapses in Quark’s bar during a fight and is surprised to see themselves from the future just kinda hanging out and taking their place",
		"cares about a gold shirt dying for the first time in five seasons",
		"finds a crashed Jem’Hadar and the Founders spaceship and secretly tries some of that Kestrel White and finds out it's just pureed soft pretzels",
		"is stuck taking care of pagh-wraith possessed Keiko again",
		"has some more wormhole catnip visions of cities buried in stone four hundred thousand years ago",
		"is obsessed with slime",
		"is sad because their slime died",
		"lets some randos hijack the station again",
		"accidentally triggers the destruction of the entire Ferengi economy",
		"takes a wrong turn in the Jeffries tubes and ends up in a Breen vape shop",
		"takes a wrong turn in the Jeffries tubes and ends up in the captain’s office",
		"takes a wrong turn in the Jeffries tubes and ends up in a KB Toys",
		"assembles a group of Ferengi commandos to rescue Moogie",
		"meets their alternate-universe counterpart",
		"is captured, sent to a Dominion prison camp, replaced by a shape shifter, again",
		"wastes the negotiation budget on Magic: The Gathering cards",
		"is trapped in a Toys ‘R’ Us overnight with Gul Dukat, who promises to have finally changed",
		"travels back in time to appear on Supermarket Sweep",
		"has a crisis of conscious over their involvement in murder for political ends",
		"has a crisis of faith",
		"is considering quitting their job and exploring space for the other 98 changelings",
		"has to reinstall the Defiant from the original floppies again after Mr. Eddington releases a cascade virus. On the plus side the ship has never smelled so clean and the photon torpedoes all came out spotless",
		"gets abducted by the Jem’Hadar while visiting some conference, they’re replaced with a changeling and sent to a labor camp for months, nobody on the station cares when they are liberated, and the writers don’t even bother with the consequences",
		"repurposes the station's computers to mine bitcoin"
	],
	
	"reason": [
		"but actually finds hundreds of inhabitants.",
		"but actually is the reason why we cry.",
		"but actually is the reason why we love.",
		"but actually is the link to the delta quadrant.",
		"but actually is the link to the alpha quadrant",
		"but accidentally causes the crew to get space drunk.",
		"but is really in the dream of a sick child at a hospital.",
		"but actually is the true source of anime on Earth.",
		"but really discovers why the spice must flow.",
		"that brings back an old cast member.",
		"but finds the ship overrun with holodeck characters!",
		"but can't escape the holodeck!",
		"but never really resolves the Klingon problem.",
		"but can't find any coffee.",
		"but can't remember the last 24 hours.",
		"but also finds an unexpected love.",
		"but is trapped in a mind-meld with another darn old Spock.",
		"but finds out that they weren't the first to visit the Delta quadrant.",
		"but finally figures out what was going on with those worms that took over Starfleet.",
		"but also starts another war!",
		"but also convinces Starfleet that holograms have rights.",
		"but also convinces Starfleet that lovebots are sentient and have rights.",
		"but also convinces Admiral Fraiser to take Space LSD.",
		"but also convinces Starfleet to let them go back to Risa.",
		"but could have solved everything if the sensors had just worked.",
		"but could have solved everything if the transporter had just worked.",
		"but could have solved everything if there was any continuity in the series.",
		"but they ran out of the special effects budget and just solved everything with a meeting.",
		"but they make a genetic duplicate in order to harvest their brain parts.",
		"but they have to find the cure to save their best friend.",
		"could have prevented all of this if they had scanned the planet first",
		"could have prevented all of this if they had scanned the ship first",
		"could have prevented all of this if they had scanned the station first",
		"but the crew has mutinied over the latest holonovel!",
		"but it turns out it's a faaaaaake",
		"but takes a wrong turn at Albuquerque",
		"but ends up stuck in the mirror universe",
		"but is suspiciously sensitive to light",
		"but the producers ran out of budget for new sets and put the legal proceedings in Quark’s bar",
		"but they’re trapped in the stick-clicking German-alien’s board game and have to move along home",
		"but the town is defeated by the Dal-Rok",
		"but has to learn a lesson about themselves before they can complete the mission",
		"but the writers ran out of excuses for the crew to be involved in some other civilization’s bullshit",
		"but this is really an episode about the B plot",
		"but the writers don’t even care about the A plot, or the B plot, or the C plot. It’s really not clear at all what is going on and then the episode just ends.",
		"but the crypto market crashes and isolinear GPU prices return to normal"
	
	]
}
